Sparkleiot/BK7239N_AT/middleware/soc/bk7236n/hal/sys_hal.c
void sys_hal_mac_clk_ctrl(bool clk_en)
{
	sys_ll_set_cpu_device_clk_enable_mac_cken(clk_en);
}



void sys_hal_set_vdd_value(uint32_t param)
{
	sys_hal_ctrl_vdddig_h_vol(param);
}

uint32_t sys_hal_get_vdd_value(void)
{
	return sys_ll_get_ana_reg8_vcorehsel();
}

//CMD_SCTRL_BLOCK_EN_MUX_SET
void sys_hal_block_en_mux_set(uint32_t param)
{
	//TODO 7256 no block en mux
}

__IRAM_SEC void sys_hal_set_sys2flsh_2wire(uint32_t value)
{
}

void sys_hal_enable_mac_gen_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_mac_int_gen_int_en(1);
}

void sys_hal_enable_mac_prot_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_port_trigger_int_en(1);
}

void sys_hal_enable_mac_tx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_trigger_int_en(1);
}

void sys_hal_enable_mac_rx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_rx_trigger_int_en(1);
}

void sys_hal_enable_mac_txrx_misc_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_rx_misc_int_en(1);
}

void sys_hal_enable_mac_txrx_timer_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_rx_timer_int_en(1);
}

void sys_hal_enable_modem_int(void)
{
}

void sys_hal_enable_modem_rc_int(void)
{
}

void sys_hal_enable_hsu_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_hsu_irq_int_en(1);
}

void sys_hal_disable_hsu_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_hsu_irq_int_en(0);
}

void sys_hal_set_debug_mux(int type)
{
	sys_ll_set_dbug_config0_dbug_mux(type);
}

void sys_hal_diag_debug_mac()
{
	sys_ll_set_dbug_config0_dbug_mux(DIAG_DEBUG_MAC);
}

void sys_hal_diag_debug_phy()
{
	sys_ll_set_dbug_config0_dbug_mux(DIAG_DEBUG_PHY);
}

// Set GPIO Mux for Debug Purpose.
void dbg_enable_debug_gpio(void)
{
	// 2 -> 9
	gpio_dev_unmap(GPIO_2);
	gpio_dev_map(GPIO_2, GPIO_DEV_DEBUG0);
	gpio_dev_unmap(GPIO_3);
	gpio_dev_map(GPIO_3, GPIO_DEV_DEBUG1);
	gpio_dev_unmap(GPIO_4);
	gpio_dev_map(GPIO_4, GPIO_DEV_DEBUG2);
	gpio_dev_unmap(GPIO_5);
	gpio_dev_map(GPIO_5, GPIO_DEV_DEBUG3);
	gpio_dev_unmap(GPIO_6);
	gpio_dev_map(GPIO_6, GPIO_DEV_DEBUG4);
	gpio_dev_unmap(GPIO_7);
	gpio_dev_map(GPIO_7, GPIO_DEV_DEBUG5);
	gpio_dev_unmap(GPIO_8);
	gpio_dev_map(GPIO_8, GPIO_DEV_DEBUG6);
	gpio_dev_unmap(GPIO_9);
	gpio_dev_map(GPIO_9, GPIO_DEV_DEBUG7);

	// 12 -> 19
	gpio_dev_unmap(GPIO_12);
	gpio_dev_map((GPIO_12), GPIO_DEV_DEBUG8);
	gpio_dev_unmap(GPIO_13);
	gpio_dev_map(GPIO_13, GPIO_DEV_DEBUG9);
	gpio_dev_unmap(GPIO_14);
	gpio_dev_map((GPIO_14), GPIO_DEV_DEBUG10);
	gpio_dev_unmap(GPIO_15);
	gpio_dev_map(GPIO_15, GPIO_DEV_DEBUG11);
	gpio_dev_unmap(GPIO_16);
	gpio_dev_map((GPIO_16), GPIO_DEV_DEBUG12);
	gpio_dev_unmap(GPIO_17);
	gpio_dev_map(GPIO_17, GPIO_DEV_DEBUG13);
	gpio_dev_unmap(GPIO_18);
	gpio_dev_map(GPIO_18, GPIO_DEV_DEBUG14);
	gpio_dev_unmap(GPIO_19);
	gpio_dev_map(GPIO_19, GPIO_DEV_DEBUG15);
}
//Yantao Add End

void sys_hal_cali_dpll_spi_trig_disable(void)
{
	// NOT SUPPORT
}

void sys_hal_cali_dpll_spi_trig_enable(void)
{
	// NOT SUPPORT
}

void sys_hal_cali_dpll_spi_detect_disable(void)
{
    sys_ll_set_ana_reg1_osccal_trig(0);
}

void sys_hal_cali_dpll_spi_detect_enable(void)
{
    sys_ll_set_ana_reg1_osccal_trig(1);
}

void sys_hal_set_xtalh_ctune(uint32_t value)
{
    sys_ll_set_ana_reg2_xtalh_ctune(value);
}

void sys_hal_analog_set(analog_reg_t reg, uint32_t value)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value(analog_reg_address, value);
}

__IRAM_SEC void sys_hal_analog_set_iram(analog_reg_t reg, uint32_t value)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value_iram(analog_reg_address, value);
}

__IRAM_SEC uint32_t sys_hal_analog_get_iram(analog_reg_t reg)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value_iram(analog_reg_address);
}

uint32_t sys_hal_analog_get(analog_reg_t reg)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value(analog_reg_address);
}
void sys_hal_set_ana_reg1_value(uint32_t value)
{
    sys_ll_set_ana_reg1_value(value);
}

void sys_hal_set_ana_reg2_value(uint32_t value)
{
    sys_ll_set_ana_reg2_value(value);
}

void sys_hal_set_ana_reg3_value(uint32_t value)
{
    sys_ll_set_ana_reg3_value(value);
}

void sys_hal_set_ana_reg4_value(uint32_t value)
{
    sys_ll_set_ana_reg4_value(value);
}

void sys_hal_set_ana_reg12_value(uint32_t value)
{
    sys_ll_set_ana_reg12_value(value);
}

void sys_hal_set_ana_reg13_value(uint32_t value)
{
    sys_ll_set_ana_reg13_value(value);
}

void sys_hal_set_ana_reg14_value(uint32_t value)
{
    // sys_ll_set_ana_reg14_value(value);
}

void sys_hal_set_ana_reg15_value(uint32_t value)
{
    // sys_ll_set_ana_reg15_value(value);
}

void sys_hal_set_ana_reg16_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg17_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg18_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg19_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg20_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg21_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg27_value(uint32_t value)
{
	// NOT SUPPORT
}

uint32_t sys_hal_bias_reg_read(void)
{
	///TODO
    return 0;
}
uint32_t sys_hal_bias_reg_write(uint32_t param)
{
	///TODO

	return 0;

}

uint32_t sys_hal_analog_reg2_get(void)
{
	///TODO

    return 0;
}

uint32_t sys_hal_bias_reg_set(uint32_t param)
{
	///TODO

	return 0;
}

uint32_t sys_hal_bias_reg_clean(uint32_t param)
{
	///TODO

