Sparkleiot/BK7239N_AT/middleware/soc/bk7236n/hal/sys_hal.c
	return 0;
}


uint32_t sys_hal_get_xtalh_ctune(void)
{
    return sys_ll_get_ana_reg2_xtalh_ctune();
}

uint32_t sys_hal_cali_bgcalm(void)
{
    uint32_t bandgap;

    sys_ll_set_ana_reg8_spi_latch1v(1);
    sys_ll_set_ana_reg7_pwd_bgcal(0);
    sys_ll_set_ana_reg7_vbgcalmode(0);
    sys_ll_set_ana_reg7_vbgcalstart(0);
    sys_ll_set_ana_reg7_vbgcalstart(1);
    bk_delay_us(100); //100us
    sys_ll_set_ana_reg7_vbgcalstart(0);

    bk_delay_us(2000); //2ms to avoid consistency issue

    bandgap = aon_pmu_ll_get_r7d_bgcal();

    sys_ll_set_ana_reg7_vbgcalmode(1);
    sys_ll_set_ana_reg7_pwd_bgcal(1);
    sys_ll_set_ana_reg8_spi_latch1v(0);

    return bandgap;
}

uint32_t sys_hal_get_bgcalm(void)
{
    return sys_ll_get_ana_reg7_bgcal();
}

void sys_hal_set_bgcalm(uint32_t value)
{
    sys_ll_set_ana_reg8_spi_latch1v(1);
    sys_ll_set_ana_reg7_bgcal(value);
    sys_ll_set_ana_reg8_spi_latch1v(0);
}

void sys_hal_set_audioen(uint32_t value)
{
}

void sys_hal_set_dpll_div_cksel(uint32_t value)
{
}

void sys_hal_set_dpll_reset(uint32_t value)
{
}

void sys_hal_set_gadc_ten(uint32_t value)
{
}
/**  WIFI End **/

/**  Audio Start  **/

void sys_hal_aud_select_clock(uint32_t value)
{
}

void sys_hal_aud_clock_en(uint32_t value)
{
}

void sys_hal_aud_mic1_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dacl_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_diffen_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic_rst_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic1_gain_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dcoc_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_lmdcin_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_audbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_adcbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dac_bias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_idac_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dac_drv_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic1_single_en(uint32_t value)
{
}

void sys_hal_aud_mic2_single_en(uint32_t value)
{
}

void sys_hal_aud_int_en(uint32_t value)
{
}

void sys_hal_aud_power_en(uint32_t value)
{
}

void sys_hal_aud_lvcmd_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias1v_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias_trim_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_audpll_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_dacr_en(uint32_t value)
{
}

void sys_hal_aud_vdd1v_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_vdd1v5_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_mic2_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_mic2_gain_set(uint32_t value)
{
	//not support
}

void sys_hal_aud_dacg_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_aud_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_rvcmd_en(uint32_t value)
{
	//not support
}

void sys_hal_dmic_clk_div_set(uint32_t value)
{
}

void sys_hal_aud_dac_dacmute_en(uint32_t value)
{
	//TODO
}

/**  Audio End  **/

/**  FFT Start  **/

void sys_hal_fft_disckg_set(uint32_t value)
{
}

void sys_hal_cpu_fft_int_en(uint32_t value)
{
}

/**  FFT End  **/

/**  I2S Start  **/
void sys_hal_i2s_select_clock(uint32_t value)
{
}

void sys_hal_i2s_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s_cken(value);
}

void sys_hal_i2s1_clock_en(uint32_t value)
{
}

void sys_hal_i2s2_clock_en(uint32_t value)
{
}

void sys_hal_i2s_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_i2s0_int_en(value);
}

void sys_hal_i2s1_int_en(uint32_t value)
{
}

void sys_hal_i2s2_int_en(uint32_t value)
{
}

void sys_hal_i2s_disckg_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_cb_manu_val_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_ana_reg11_vsel_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_cal_val_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_apll_spi_trigger_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_i2s0_ckdiv_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_config_set(uint32_t value)
{
	// NOT SUPPORT
}


/**  I2S End  **/


/** jpeg start **/
void sys_hal_set_jpeg_clk_sel(uint32_t value)
{
}

void sys_hal_set_clk_div_mode1_clkdiv_jpeg(uint32_t value)
{
}

void sys_hal_set_jpeg_disckg(uint32_t value)
{
}

void sys_hal_set_cpu_clk_div_mode1_clkdiv_bus(uint32_t value)
{
}

void sys_hal_video_power_en(uint32_t value)
{
}

void sys_hal_set_auxs_cis_clk_sel(uint32_t value)
{
}

void sys_hal_set_auxs_cis_clk_div(uint32_t value)
{
}

void sys_hal_set_jpeg_clk_en(uint32_t value)
{
}

void sys_hal_set_cis_auxs_clk_en(uint32_t value)
{
}

/** jpeg end **/

/** h264 Start **/
void sys_hal_set_h264_clk_en(uint32_t value)
{
}

/** h264 End **/

void sys_hal_set_ana_vddgpio_sel(uint32_t value)
{
	sys_ana_ll_set_ana_reg4_vddgpio_sel(value);
}

/**  psram Start **/
void sys_hal_psram_volstage_sel(uint32_t enable)
{
	sys_ana_ll_set_ana_reg4_swb(enable); //1-1.8v, 0-3.0v
}

void sys_hal_psram_xtall_osc_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_xtall(enable);
}

void sys_hal_psram_doc_enable(uint32_t enable)
{
	// NOT SUPPORT
}

void sys_hal_psram_ldo_enable(uint32_t enable)
{
	sys_ana_ll_set_ana_reg4_en_psramldo(enable);
}

void sys_hal_psram_dpll_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_dpll(enable);
}

void sys_hal_psram_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_psram(value);
}

void sys_hal_psram_set_clkdiv(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_psram(value);
}

void sys_hal_psram_psldo_vsel(uint32_t value)
{
	sys_ana_ll_set_ana_reg4_vpsramsel(value);// 1.8V + step 50mv
}

void sys_hal_psram_psldo_vset(uint32_t output_voltage, uint32_t is_add_200mv)
{
	// NOT SUPPORT
	// psldo_swb=1, vpsramsel=0 - 1.80v
	// psldo_swb=1, vpsramsel=1 - 1.85v
	// psldo_swb=1, vpsramsel=2 - 1.90v
	// psldo_swb=1, vpsramsel=3 - 1.95v
	// psldo_swb=0, vpsramsel=* - 3.00v
	sys_ana_ll_set_ana_reg4_swb(output_voltage); //1-1.8v, 0-3.0v
	sys_ana_ll_set_ana_reg4_vpsramsel(is_add_200mv);// 1.8V + step 50mv
}

void sys_hal_psram_psram_disckg(uint32_t value)
{
	// not support
}

