Sparkleiot/BK7239N_AT/middleware/soc/bk7236n/hal/sys_hal.c
/**  psram End **/

/* REG_0x03:cpu_storage_connect_op_select->flash_sel:0: normal flash operation 1:flash download by spi,R/W,0x3[9]*/
uint32_t sys_hal_get_cpu_storage_connect_op_select_flash_sel(void)
{
    return sys_ll_get_cpu_storage_connect_op_select_flash_sel();
}

void sys_hal_set_cpu_storage_connect_op_select_flash_sel(uint32_t value)
{
    sys_ll_set_cpu_storage_connect_op_select_flash_sel(value);
}

/** Ethernet start **/
#ifdef CONFIG_ETH
void sys_hal_enable_eth_int(uint32_t value)
{
}
#endif
/** Ethernet End**/

/**  Misc Start **/
//Misc
/**  Misc End **/

void sys_hal_set_ana_trxt_tst_enable(uint32_t value)
{
}

void sys_hal_set_ana_scal_en(uint32_t value)
{
}

void sys_hal_set_ana_gadc_buf_ictrl(uint32_t value)
{
}

void sys_hal_set_ana_hres_sel0v9(uint32_t value)
{
}

void sys_hal_set_ana_gadc_cmp_ictrl(uint32_t value)
{
}

void sys_hal_set_ana_pwd_gadc_buf(uint32_t value)
{
}

void sys_hal_set_ana_vref_sel(uint32_t value)
{
}

void sys_hal_set_ana_cb_cal_manu(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_en(value);
}

void sys_hal_set_ana_cb_cal_trig(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_start(value);
}

void sys_hal_set_ana_vlsel_ldodig(uint32_t value)
{
}

void sys_hal_set_ana_vhsel_ldodig(uint32_t value)
{
}

void sys_hal_set_sdio_clk_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_sdio_cken(value);
}

void sys_hal_set_cpu0_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_sdio_int_en(value);
}

void sys_hal_set_sdio_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_div()
{
	return sys_ll_get_cpu_clk_div_mode2_ckdiv_sdio();
}

void sys_hal_set_sdio_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_sel()
{
	return sys_ll_get_cpu_clk_div_mode2_cksel_sdio();
}


void sys_hal_set_ana_vctrl_sysldo(uint32_t value)
{
}

void sys_hal_set_yuv_buf_clock_en(uint32_t value)
{
}

void sys_hal_set_h264_clock_en(uint32_t value)
{
}

void sys_hal_nmi_wdt_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_wdt(value);
}

__IRAM_SEC uint32_t sys_hal_nmi_wdt_get_clk_div(void)
{
	return sys_ll_get_cpu_26m_wdt_clk_div_ckdiv_wdt();
}


void sys_hal_set_ana_cb_cal_manu_val(uint32_t value)
{
    sys_ll_set_ana_reg5_vbias(value);
}

__IRAM_SEC void sys_hal_set_ana_reg11_apfms(uint32_t value) {
	// NOT SUPPORT
}

__IRAM_SEC void sys_hal_set_ana_reg12_dpfms(uint32_t value) {
	// NOT SUPPORT
}

#if CONFIG_ANA_RTC || CONFIG_ANA_GPIO
void sys_hal_set_ana_reg8_spi_latch1v(uint32_t value)
{
	sys_ll_set_ana_reg8_spi_latch1v(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_spi_latch1v_iram(uint32_t value)
{
	sys_ll_set_ana_reg8_spi_latch1v_iram(value);
}

void sys_hal_set_ana_reg5_adc_div(uint32_t value)
{
	// sys_ll_set_ana_reg5_adc_div(value);
}

void sys_hal_set_ana_reg5_pwd_rosc_spi(uint32_t value)
{
	sys_ll_set_ana_reg5_pwd_rosc_spi(value);
}
void sys_hal_set_ana_reg5_rosc_disable(uint32_t value)
{
	sys_ll_set_ana_reg5_rosc_disable(value);
}

__IRAM_SEC void sys_hal_set_ana_reg7_timer_wkrstn(uint32_t value)
{
	sys_ll_set_ana_reg7_timer_wkrstn(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_rst_timerwks1v(uint32_t value)
{
	sys_ll_set_ana_reg8_rst_timerwks1v(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_rst_gpiowks(uint32_t value)
{
	sys_ll_set_ana_reg8_rst_gpiowks(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_lvsleep_wkrst(uint32_t value)
{
	sys_ll_set_ana_reg8_lvsleep_wkrst(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_gpiowk_rstn(uint32_t value)
{
	sys_ll_set_ana_reg8_gpiowk_rstn(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_rtcwk_rstn(uint32_t value)
{
	sys_ll_set_ana_reg8_rtcwk_rstn(value);
}
void sys_hal_set_ana_reg8_ensfsdd(uint32_t value)
{
	sys_ll_set_ana_reg8_ensfsdd(value);
}

void sys_hal_set_ana_reg8_vlden(uint32_t value)
{
	sys_ll_set_ana_reg8_vlden(value);
}

void sys_hal_set_ana_reg8_pwdovp1v(uint32_t value)
{
	// sys_ll_set_ana_reg8_pwdovp1v(value);
}
void sys_hal_set_ana_reg9_spi_timerwken(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_timerwken(value);
}

void sys_hal_set_ana_reg7_clk_sel(uint32_t value)
{
	sys_ll_set_ana_reg7_clk_sel(value);
}

void sys_hal_set_ana_reg9_spi_byp32pwd(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_byp32pwd(value);
}

uint32_t sys_hal_get_ana_reg11_gpiowk(void)
{
	return sys_ll_get_ana_reg11_gpiowk();
}

__IRAM_SEC void sys_hal_set_ana_reg11_gpiowk(uint32_t value)
{
	sys_ll_set_ana_reg11_gpiowk(value);
}

__IRAM_SEC uint32_t sys_hal_get_ana_reg11_rtcsel(void)
{
	return sys_ll_get_ana_reg11_rtcsel();
}

__IRAM_SEC void sys_hal_set_ana_reg11_rtcsel(uint32_t value)
{
	sys_ll_set_ana_reg11_rtcsel(value);
}

__IRAM_SEC uint32_t sys_hal_get_ana_reg11_timersel(void)
{
	return sys_ll_get_ana_reg11_timersel();
}

__IRAM_SEC void sys_hal_set_ana_reg11_timersel(uint32_t value)
{
	sys_ll_set_ana_reg11_timersel(value);
}

__IRAM_SEC uint32_t sys_hal_get_ana_reg12_timersel(void)
{
	return sys_ll_get_ana_reg12_timersel();
}

__IRAM_SEC void sys_hal_set_ana_reg12_timersel(uint32_t value)
{
	sys_ll_set_ana_reg12_timersel(value);
}

__IRAM_SEC uint32_t sys_hal_get_ana_reg13_rtcsel(void)
{
	return sys_ll_get_ana_reg13_rtcsel();
}

__IRAM_SEC void sys_hal_set_ana_reg13_rtcsel(uint32_t value)
{
	sys_ll_set_ana_reg13_rtcsel(value);
}
#endif

static void sys_hal_delay(volatile uint32_t times)
{
        while(times--);
}

__IRAM_SEC void sys_hal_adjust_dpll(void)
{
    uint32_t unlock, unlockL = 0, unlockH = 0;
    int32_t dpll_band, count;

    unlock = aon_pmu_hal_get_dpll_unlock(&unlockL, &unlockH);
    if (!unlock) {
        return;
    }
    dpll_band = (int32_t)sys_ll_get_ana_reg1_bandmanual();
    for (count = 7; count > 0; count--) {
        if (unlockL) {
            dpll_band++;
        } else {
            dpll_band--;
        }
        if (dpll_band < 0) {
            break;
        } else if (dpll_band > 0x7F) {
            break;
        }
        sys_ll_set_ana_reg1_bandmanual(dpll_band);
    }
}

uint32_t sys_hal_cali_dpll(uint32_t first_time)
{
    uint32_t int_mask = sys_hal_int_group2_disable(DPLL_UNLOCK_INTERRUPT_CTRL_BIT);

