Sparkleiot/BK7239N_AT/middleware/soc/bk7236n/hal/sys_hal.c
#define FLASH_MAX_CLK    120    // 120MHz
#define FLASH_80M_CLK    80    // 80MHz
#define CPU_CLK_XTAL    40    // 40MHz

void sys_hal_set_flash_clk(uint32_t flash_clk)
{
	uint32_t flash_max_clk = FLASH_MAX_CLK;
	uint32_t flash_80m_clk = FLASH_80M_CLK;
	uint32_t calculated_div = flash_80m_clk / flash_clk;
	uint32_t flash_div = 0;

	if (flash_clk == CPU_CLK_XTAL) {
		sys_ll_set_cpu_clk_div_mode2_cksel_flash(0);
	} else if (flash_clk == 80) {
		sys_ll_set_cpu_clk_div_mode2_cksel_flash(2);
		if (calculated_div == 1) {          //0:/1  1:/2  2:/4  3:8，it is invalid when cksel_flash=0 and 1
			flash_div = 0;
		} else if (calculated_div == 2) {
			flash_div = 1;
		} else if (calculated_div == 4) {
			flash_div = 2;
		} else {
			flash_div = 3;
		}
		sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(flash_div);
	} else {
		calculated_div = flash_max_clk / flash_clk;
		sys_ll_set_cpu_clk_div_mode2_cksel_flash(3);
		if (calculated_div <= 1) {          //0:/1  1:/2  2:/4  3:8，it is invalid when cksel_flash=0 and 1
			flash_div = 0;
		} else if (calculated_div <= 2) {
			flash_div = 1;
		} else if (calculated_div <= 4) {
			flash_div = 2;
		} else {
			flash_div = 3;
		}
		sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(flash_div);
	}
}

void sys_hal_set_cpu_clk(uint32_t cpu_clk)
{
	if (cpu_clk <= CPU_CLK_XTAL) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_XTAL);
	} else if (cpu_clk <= 60) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_60M);
	} else if (cpu_clk <= 80) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_80M);
	} else if (cpu_clk <= 120) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_120M);
	} else if (cpu_clk <= 160) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_160M);
	} else {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_240M);
	}
}

__IRAM_SEC void sys_hal_enable_pll_iram(void)
{
	uint32_t ana_reg1_val = REG_READ(0x2807e400 + (1 << 2));  // restore sys0x41 from ram
	uint32_t ana_reg5_val = sys_hal_analog_get(5);  // sys0x45 corresponds to ana_reg_5
	sys_hal_analog_set(1, ana_reg1_val);

	// 1. Enable PLL (set bit 5 of ana_reg_5)
	ana_reg5_val |= (1 << 5);  // Set bit 5
	sys_hal_analog_set(5, ana_reg5_val);

	// 2. Synchronize ASIC
	sys_ll_set_cpu_device_clk_enable_dplldiv_cken(1);
}

__IRAM_SEC void sys_hal_enable_high_freq_iram(void)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(0x0);
	sys_ll_set_cpu_clk_div_mode2_cksel_flash(0x2);//some flash ,such as : flash mid = 0xC86516 ,max freq is 104M

	sys_ll_set_cpu_clk_div_mode1_clkdiv_core(3);
	sys_ll_set_cpu_clk_div_mode1_cksel_core(1);
}

/**  SCR End  */
